#pragma once

/************************************************************************/
/* 使用方式：1、应用获取该类指针（非多线程安全）用于操作桌面插件	   */
/*					 2、判断插件是否正在工作，如果未工作，注入插件				   */
/*					 3、增加插件引用																	   */
/*					 4、程序退出后，减少插件引用												   */
/*					 5、APP注册 _T("TOGGLEDESKTOP")消息，插件会发送广播   */
/************************************************************************/

/************************************************************************/
//	1、m_pToggleDesktopHelper = ToggleDesktopHelper::GetInstance();	
// 2、m_pToggleDesktopHelper->IsShellDesktopRunning();
// 3、InjectDll();
// 4、m_pToggleDesktopHelper->AddRef();
// 5、m_pToggleDesktopHelper->Release();
/************************************************************************/

#ifdef LS_STATIC_LIB_CALL
#define DLL_API
#elif defined  DLL_EXPORTS
#define DLL_API __declspec(dllexport)
#else
#define DLL_API __declspec(dllimport)
#endif

#include "Desktop.h"

class DLL_API ToggleDesktopHelper
{
public:
	static ToggleDesktopHelper* GetInstance();
protected:
	ToggleDesktopHelper();
	~ToggleDesktopHelper();
public:
	/************************************************************************/
	/* 函数名称：AddRef			                                                                       */
	/* 函数说明：增加插件引用																		   */
	/* 函数参数：无																						   */
	/* 返 回  值：无																						   */
	/************************************************************************/
	void AddRef();

	/************************************************************************/
	/* 函数名称：Release			                                                                       */
	/* 函数说明：减少插件引用，非释放指针（程序退出后，系统自动释放）	   */
	/* 函数参数：无																						   */
	/* 返 回  值：无																						   */
	/************************************************************************/
	void Release();

	/************************************************************************/
	/* 函数名称：FreeLibrary		                                                                       */
	/* 函数说明：强制卸载桌面插件，否则后续无法升级									   */
	/* 函数参数：无																						   */
	/* 返 回  值：无																						   */
	/************************************************************************/
	void FreeLibrary();

	/************************************************************************/
	/* 函数名称：IsShellDesktopRunning                                                        */
	/* 函数说明：判断注入系统桌面的插件是否工作										   */
	/* 函数参数：无																						   */
	/* 返 回  值：插件工作中返回TRUE，否则返回FALSE									   */
	/************************************************************************/
	BOOL IsShellDesktopRunning();

	/************************************************************************/
	/* 函数名称：GetReferenceCount		                                                       */
	/* 函数说明：获取插件引用计数																   */
	/* 函数参数：无																						   */
	/* 返 回  值：返回插件引用计数																	   */
	/************************************************************************/
	DWORD GetReferenceCount();
};